app/controllers/school_classes_controller.rb

  def update
    @school_class = SchoolClass.find(params[:id])
		@school_class.update(school_class_params(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", nil], ["updated_at", "2020-04-07 09:36:45.287028"], ["id", 3]]